Changes before error encountered
Agent-Logs-Url: https://github.com/IntegrationProject-Groep1/xml-xsd-contract/sessions/9435460d-b8ac-4be6-8216-1c3d892ed3fe

Co-authored-by: Jeremy-Luyckfasseel <162044174+Jeremy-Luyckfasseel@users.noreply.github.com>
